##
# brew bundle install --upgrade
# brew bundle --help
##

tap "minamijoyo/tfschema"
tap "trufflesecurity/trufflehog"

brew "bash"
brew "coreutils"
brew "dependabot"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "librsvg"
brew "make"
brew "moreutils"
brew "tenv"

# ogvs

# brew "bats-core"
# brew "direnv"
# brew "editorconfig-checker"
# brew "fzf"
# brew "git-cliff"
# brew "git-lfs"
# brew "go"
# brew "golangci-lint"
# brew "gum"
# brew "infracost"
# brew "jq"
# brew "minamijoyo/tfschema/tfschema"
# brew "node"
# brew "python@3.13"
# brew "shellcheck"
# brew "shfmt"
# brew "tflint"
# brew "trivy"
# brew "trufflesecurity/trufflehog/trufflehog"
# brew "uv"
